webhooks/src/test/resources/invoice_payment_succeeded.json

{
  "id": "evt_1LrQOvKiza8a4VRDXsQYyyrR",
  "object": "event",
  "api_version": "2022-08-01",
  "created": 1665425308,
  "data": {
    "object": {
      "id": "in_1LrQOsKiza8a4VRD9doWxkXU",
      "object": "invoice",
      "account_country": "US",
      "account_name": null,
      "account_tax_ids": null,
      "amount_due": 65000,
      "amount_paid": 65000,
      "amount_remaining": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "subscription_create",
      "charge": "ch_3LrQOtKiza8a4VRD1qkhefFU",
      "collection_method": "charge_automatically",
      "created": 1665425306,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_MZTka5dHgQyn7L",
      "customer_address": null,
      "customer_email": "testEmail@test.com",
      "customer_name": "Subscriptions Demo Customer",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [

      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [

      ],
      "description": null,
      "discount": null,
      "discounts": [

      ],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1LX6qJKiza8a4VRD/test_YWNjdF8xTFg2cUpLaXphOGE0VlJELF9NYWJjcGhnaGRaQ3psbElZZm40ZXN1bzN2N2ZHVzdpLDU1OTY2MTA502009eZtg1B9?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1LX6qJKiza8a4VRD/test_YWNjdF8xTFg2cUpLaXphOGE0VlJELF9NYWJjcGhnaGRaQ3psbElZZm40ZXN1bzN2N2ZHVzdpLDU1OTY2MTA502009eZtg1B9/pdf?s=ap",
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1LrQOsKiza8a4VRDJzXXrzft",
            "object": "line_item",
            "amount": 65000,
            "amount_excluding_tax": 65000,
            "currency": "usd",
            "description": "1 × Pro LLC (at $250.00 / year)",
            "discount_amounts": [

            ],
            "discountable": true,
            "discounts": [

            ],
            "livemode": false,
            "metadata": {
              "someKey": "someval",
              "orderID": "order_123",
              "lzCustomerId": "SampleLzCustomerId"
            },
            "period": {
              "end": 1696961306,
              "start": 1665425306
            },
            "plan": {
              "id": "price_1LYBf3Kiza8a4VRD1koF4TaR",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 65000,
              "amount_decimal": "65000",
              "billing_scheme": "per_unit",
              "created": 1660840417,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_MGj7ttCJdJyL1H",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1LYBf3Kiza8a4VRD1koF4TaR",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1660840417,
              "currency": "usd",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_MGj7ttCJdJyL1H",
              "recurring": {
                "aggregate_usage": null,
                "interval": "year",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 65000,
              "unit_amount_decimal": "65000"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1LrQOsKiza8a4VRD6UG8f2o7",
            "subscription_item": "si_MabcONSFqTqRNI",
            "tax_amounts": [

            ],
            "tax_rates": [

            ],
            "type": "subscription",
            "unit_amount_excluding_tax": "65000"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1LrQOsKiza8a4VRD9doWxkXU/lines"
      },
      "livemode": false,
      "metadata": {
        "someKey": "aa",
        "orderID": "3032",
        "size": "small"
      },
      "next_payment_attempt": null,
      "number": "F0E232B1-0004",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3LrQOtKiza8a4VRD1doQgr9c",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1665425306,
      "period_start": 1665425306,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering_options": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1665425306,
        "marked_uncollectible_at": null,
        "paid_at": 1665425306,
        "voided_at": null
      },
      "subscription": "sub_1LrQOsKiza8a4VRD6UG8f2o7",
      "subtotal": 65000,
      "subtotal_excluding_tax": 65000,
      "tax": null,
      "test_clock": null,
      "total": 65000,
      "total_discount_amounts": [

      ],
      "total_excluding_tax": 65000,
      "total_tax_amounts": [

      ],
      "transfer_data": null,
      "webhooks_delivered_at": 1665425306
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_Y7iAR52xYJs41C",
    "idempotency_key": "08c345fd8d28381e4a030bff1b0f8c80"
  },
  "type": "invoice.payment_succeeded"
}
